cases/exposureCell/constant/aerosolProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      aerosolProperties;
}

aerosolModel    fixedSectional;

diameter
{
    min     1E-9;
    max     1E-3;
}

twoMomentLogNormalAnalyticalCoeffs
{
    sigma   4.0;
}

fixedSectionalCoeffs
{
    distribution
    {
        type    logarithmic;
        yMin    1E-22;
        yMax    1E-12;
        N       16;
    }

    interpolation
    {
        type    twoMoment;
    }

    rescale     false;

    initFromPatch inlet;
}

submodels
{
    condensation
    {
        type        none;
    }

    nucleation
    {
        type        none;
    }

    coalescence
    {
        type        none;
    }

    driftFluxModel
    {
        diffusion
        {
            type        none;
        }

        Brownian
        {
            type        StokesEinstein;
        }

        inertial
        {
            type        fullStokes;
            tolerance   1E-10;
            maxIter     5;
            VMax        10.0;
        }
    }
}
