cases/exposureCell/0.org/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type        flowRateInletVelocity;
        volumetricFlowRate constant 1.061032954e-09;
        extrapolateProfile no;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    lower
    {
        type        noSlipContinuous;
        value       $internalField;
    }

    walls
    {
        type        noSlipContinuous;
        value       $internalField;
    }

    rear
    {
        type        wedge;
    }

    front
    {
        type        wedge;
    }

    axis
    {
        type        empty;
    }
}
