cases/exposureCell/0.org/M
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      M;
}

dimensions      [-1 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type        sectionalConstant;
        value       $internalField;
    }

    outlet
    {
        type        sectionalMixedAbsorbing;
        value       $internalField;
    }

    lower
    {
        type        sectionalMixedAbsorbing;
        value       $internalField;
    }

    walls
    {
        type        sectionalMixedAbsorbing;
        value       $internalField;
    }

    rear
    {
        type        wedge;
    }

    front
    {
        type        wedge;
    }

    axis
    {
        type        empty;
    }
}
