cases/exposureCell/0.org/V
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      V;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        zeroGradient;
    }

    lower
    {
        type        sectionalSubGridDepositionVelocity;
        value       $internalField;
    }

    walls
    {
        type        sectionalSubGridDepositionVelocity;
        value       $internalField;

    }
    rear
    {
        type        wedge;
    }

    front
    {
        type        wedge;
    }

    axis
    {
        type        empty;
    }
}
